Repository: darktable-org/darktable
Catalog: doc/usermanual/po/pl.tmx
Source language: en
Languages: pl

source: Virtual Lighttable and Darkroom
pl: Wirtualny Stół Podświetlany i Ciemnia

source: Organize and develop images from digital cameras
pl: Organizuj i obrabiaj zdjęcia z aparatów cyfrowych

source: graphics;photography;raw;
pl: grafika;fotografia;raw;

source: lighttable
pl: stół podświetlany

source: color manage cached thumbnails
pl: włącz zarządzanie kolorem zapisanych miniaturek

source: double click to reset to `%s'
pl: kliknij dwukrotnie, aby zresetować do „%s”

source: TRUE
pl: TAK

source: if enabled, cached thumbnails will be color managed so that lighttable and filmstrip can show correct colors. otherwise the results may look wrong once the display profile gets changed.
pl: po włączeniu, zapisane miniaturki będą poddane zarządzaniu kolorem. dzięki temu stół podświetlany i taśma filmowa będą miały poprawne kolory. w przeciwnym wypadku rezultat może być niepoprawny przy zmianie profilu wyświetlania.

source: don't use embedded preview JPEG but half-size raw
pl: używaj półwymiarowego pliku raw zamiast wbudowanego podglądu JPEG

source: FALSE
pl: NIE

source: check this option to not use the embedded JPEG from the raw file but process the raw data. this is slower but gives you color managed thumbnails.
pl: zaznacz tę opcję jeśli zamiast wbudowanego podglądu JPEG z pliku raw mają być użyte przetworzone dane raw. jest to wolniejsze, ale powstałe miniatury są zgodne z zarządzaniem kolorem.

source: number of folder levels to show in lists
pl: liczba poziomów katalogów pokazywanych w listach

source: double click to reset to `%d'
pl: kliknij dwukrotnie, aby zresetować do „%d”

source: the number of folder levels to show in film roll names, starting from the right
pl: liczba poziomów katalogów pokazywana w nazwach rolek filmu, począwszy od prawej

source: sort collection recent to older
pl: sortuj kolekcję od najnowszych do najstarszych

source: changes the default collections-list order for folders, times and dates to run from recent to older
pl: zmienia domyślny sposób sortowania kolekcji dla folderów, czasu i dat - od najnowszego do najstarszego

source: high quality thumb processing from size
pl: generuj wysokiej jakości miniaturki od rozmiaru

source: always
pl: zawsze

source: small
pl: małe

source: never
pl: nigdy

source: if the thumbnail size is greater than this value, it will be processed using the full quality rendering path (better but slower).
pl: jeśli rozmiar miniaturki jest większy niż podana wartość, zostanie ona utworzona przy pomocy renderowania o pełnej jakości (lepsze, ale wolniejsze)

source: delimiters for sizes categories
pl: separator kategorii rozmiarów

source: sizes categories are used to be able to set different overlays and css values depending of the size of the thumbnail.
pl: kategorie rozmiaru pozwalają ustawić różne nakładki i wartości css dla różnych rozmiarów miniatur

source: pattern for the thumbnail extended overlay text
pl: szablon rozszerzonej nakładki dla miniatur

source: see manual to know all the tags you can use.
pl: spójrz do podręcznika, aby dowiedzieć się jakich zmiennych możesz użyć.

source: pattern for the thumbnail tooltip (empty to disable)
pl: szablon podpowiedzi dla miniatury (ustaw pusty, aby wyłączyć)

source: use single-click in the collect panel
pl: używaj pojedynczego kliknięcia w panelu kolekcji

source: check this option to use single-click to select items in the collect panel. this will allow you to do range selections for date-time and numeric values.
pl: zaznacz tę opcję aby używać pojedynczego kliknięcia w panelu kolekcji. to umożliwi zaznaczanie zakresu dla daty-czasu i wartości numerycznych.

source: overlay txt sidecar over zoomed images
pl: nałóż zawartość pomocniczego pliku txt na przybliżonych zdjęciach

source: when there is a txt file next to an image it can be shown as an overlay over zoomed images on the lighttable. the txt file either has to be there at import time or the crawler has to be enabled
pl: jeśli istnieje plik txt towarzyszący plikowi zdjęcia, może zostać wyświetlony jako nakładka na powiększonym zdjęciu w trybie stołu podświetlanego. plik txt musi istnieć w czasie importu lub crawler musi być włączony

source: expand a single lighttable module at a time
pl: rozwiń jeden moduł stołu podświetlanego na raz

source: this option toggles the behavior of shift clicking in lighttable mode
pl: ta opcja przełącza zachowanie kliknięcia z shiftem w trybie stołu podświetlanego

source: scroll to lighttable modules when expanded/collapsed
pl: przewiń do modułów stołu podświetlanego podczas rozwijania/zwijania

source: when this option is enabled then darktable will try to scroll the module to the top of the visible list
pl: gdy ta opcja jest zaznaczona, darktable spróbuje przewinąć moduł na górę widocznej listy

source: rating an image one star twice will not zero out the rating
pl: dwukrotne przyznanie jednej gwiazdki nie wyzeruje oceny

source: do not have the rating of one star behave as documented in the manual--an image rated one star twice will result in a zero star rating.
pl: przyznanie jednej gwiazdki nie będzie się zachowywać tak, jak opisano w podręczniku - zdjęcie dwukrotnie ocenione na jedną gwiazdkę otrzyma ocenę zero.

source: show scrollbars for central view
pl: wyświetl paski przewijania w centralnym obszarze

source: defines whether scrollbars should be displayed
pl: ustala, kiedy paski przewijania powinny być wyświetlane

source: darkroom
pl: ciemnia

source: pen pressure control for brush masks
pl: sterowanie naciskiem pędzla dla masek cieniowanych

source: off
pl: wył.

source: hardness (relative)
pl: twardość (względna)

source: hardness (absolute)
pl: twardość (bezwzględna)

source: opacity (relative)
pl: krycie (względne)

source: opacity (absolute)
pl: krycie (bezwzględne)

source: brush size (relative)
pl: rozmiar pędzla (względny)

source: off - pressure reading ignored, hardness/opacity/brush size - pressure reading controls specified attribute, absolute/relative - pressure reading is taken directly as attribute value or multiplied with pre-defined setting.
pl: brak - nacisk będzie ignorowany, twardość/krycie/rozmiar pędzla - nacisk steruje wybranym parametrem, bezwzględne/względne - nacisk będzie stosowany bezpośrednio lub ze wstępnie ustawionym współczynnikiem.

source: smoothing of brush strokes
pl: wygładzanie pociągnięć pędzla

source: low
pl: niska

source: medium
pl: średnia

source: high
pl: wysoka

source: sets level for smoothing of brush strokes. stronger smoothing leads to less nodes and easier editing but with lower control of accuracy.
pl: ustawia poziom wygładzania pociągnięć pędzla. silniejsze wygładzanie prowadzi do mniejszej ilości węzłów i skutkuje łatwiejszą edycją, ale daje mniejszą kontrolę nad dokładnością.

source: display of individual color channels
pl: wyświetlanie indywidualnych kanałów koloru

source: false color
pl: fałszywy kolor

source: grey scale
pl: skala szarości

source: defines how color channels are displayed when activated in the parametric masks feature.
pl: ustala, jak kanały koloru będą wyświetlane po aktywowaniu w parametrycznych maskach.

source: pattern for the image infos line
pl: wzór informacji o zdjęciu

source: position of the image infos line
pl: położenie informacji o zdjęciu

source: top left
pl: na górze po lewej

source: top right
pl: na górze po prawej

source: top center
pl: na górze po środku

source: bottom
pl: na dole

source: hidden
pl: ukryte

source: show search module text entry
pl: wyszukiwanie modułów

source: show search text
pl: pokaż wyszukiwarkę tekstową

source: show groups
pl: pokaż grupy

source: show both
pl: pokaż oba

source: expand a single darkroom module at a time
pl: rozwiń jeden moduł ciemni na raz

source: this option toggles the behavior of shift clicking in darkroom mode
pl: ta opcja przełącza zachowanie kliknięcia z shiftem w trybie ciemni

source: expand the module when it is activated, and collapse it when disabled
pl: rozwiń moduł, gdy jest aktywowany i zwiń, gdy jest wyłączony

source: this option allows to expand or collapse automatically the module when it is enabled or disabled.
pl: ta opcja umożliwia rozwijanie i zwijanie modułu automatycznie, gdy jest włączany lub wyłączany.

source: scroll to darkroom modules when expanded/collapsed
pl: przewiń do modułów ciemni podczas rozwijania/zwijania

source: border around image in darkroom mode
pl: ramka wokół zdjęcia w trybie ciemni

source: process the image in darkroom mode with a small border. set to 0 if you don't want any border.
pl: szerokość ramki wokół zdjęcia w trybie ciemni. ustaw 0, jeśli nie chcesz ramki.

source: demosaicing for zoomed out darkroom mode
pl: metoda demozaikowania dla trybu ciemni bez przybliżenia

source: always bilinear (fast)
pl: zawsze bilinearne (szybkie)

source: at most PPG (reasonable)
pl: co najwyżej PPG (rozsądne)

source: full (possibly slow)
pl: pełne (może być wolne)

source: interpolation when not viewing 1:1 in darkroom mode: bilinear is fastest, but not as sharp. middle ground is using PPG + interpolation modes specified below, full will use exactly the settings for full-size export. X-Trans sensors use VNG rather than PPG as middle ground.
pl: interpolacja w trybie ciemni w skali innej niż 1:1: dwuliniowa jest najszybsza, ale niezbyt ostra. kompromisem jest używanie PPG + trybów interpolacji określonych poniżej. interpolacja pełna będzie korzystać z ustawień dla pełnowymiarowego eksportu. sensory X-Trans używają VNG raczej niż PPG jako kompromisu.

source: reduce resolution of preview image
pl: zmniejsz rozdzielczość podglądu obrazu

source: original
pl: oryginalna

source: to 1/2
pl: do 1/2

source: to 1/3
pl: do 1/3

source: to 1/4
pl: do 1/4

source: decrease to speed up preview rendering, may hinder accurate masking
pl: zmniejsz aby przyspieszyć wyświetlanie miniatury. może niekorzystnie wpłynąć na precyzję maskowania.

source: other views
pl: inne widoki

source: map / geolocalisation
pl: mapa / geolokacja

source: only draw images on map that are currently collected and filtered
pl: pokaż na mapie tylko zdjęcia będące aktualnie w kolekcjach i przefiltrowane

source: use the current filter settings to select the geotagged images drawn on the map, i.e. limit the images drawn to the current filmstrip. this limits the number of images drawn and thus reduces the time needed to draw the images.
pl: użyj aktualnych ustawień filtrowania, aby wybrać zdjęcia z geotagami do narysowania na mapie, tj. ogranicz rysowane zdjęcia do bieżącej taśmy filmowej. ogranicza to ilość zdjęć do narysowania i redukuje czas operacji.

source: maximum number of images drawn on map
pl: maksymalna liczba zdjęć rysowana na mapie

source: the maximum number of geotagged images drawn on the map. increasing this number can slow drawing of the map down.
pl: maksymalna liczba zdjęć z geotagami pokazywanych na mapie. zwiększenie tej liczby może zwolnić wyświetlanie mapy.

source: pretty print the image location
pl: pokazuj lokalizację zdjęcia w czytelniejszy sposób

source: show a more readable representation of the location in the image information module
pl: wyświetlaj czytelniejszą reprezentację lokalizacji w module informacyjnym zdjęcia

source: slideshow
pl: pokaz slajdów

source: waiting time between each picture in slideshow
pl: opóźnienie pomiędzy zdjęciami w pokazie slajdów

source: do high quality processing for slideshow
pl: wysokiej jakości przetwarzanie podczas pokazu slajdów

source: same option as for export, but applies to slideshow.
pl: ta sama opcja jak dla eksportu, ale dotyczy pokazu slajdów.

source: processing
pl: przetwarzanie

source: always use LittleCMS 2 to apply output color profile
pl: zawsze używaj LittleCMS 2 do stosowania wyjściowego profilu kolorów

source: this is slower than the default.
pl: jest to znacznie wolniejsze niż ustawienie domyślne.

source: pixel interpolator
pl: interpolacja pikseli

source: bilinear
pl: dwuliniowa

source: bicubic
pl: dwusześcienna

source: pixel interpolator used in rotation and lens correction (bilinear, bicubic, lanczos2, lanczos3).
pl: interpolacja pikseli używana przy rotacji i korekcji obiektywu (bilinear, bicubic, lanczos2, lanczos3).

source: 3D lut root folder
pl: główny katalog z plikami LUT

source: select directory
pl: wybierz katalog

source: this folder (and sub-folders) contains Lut files used by lut3d modules. need to restart darktable.
pl: ten katalog (oraz podkatalogi) zawiera pliki używane przez moduł lut3d. wymaga restartu darktable.

source: auto-apply basecurve
pl: automatycznie zastosuj krzywą bazową

source: use a basecurve by default (needs a restart)
pl: stosuj domyślnie krzywą bazową (wymaga restartu)

source: auto-apply per camera basecurve presets
pl: automatycznie zastosuj krzywe bazowe dopasowane do aparatu

source: use the per-camera basecurve by default instead of the generic manufacturer one if there is one available (needs a restart)
pl: używaj krzywe bazowe dopasowane do aparatu zamiast generycznych, jeśli są dostępne (wymaga ponownego uruchomienia)

source: auto-apply sharpen
pl: automatycznie zastosuj wyostrzanie

source: this added sharpen is not recommended on cameras without a low-pass filter. you should disable this option if you use one of those more recent cameras or sharpen your images with other means. (need a restart)
pl: takie dodatkowe wyostrzanie nie jest polecane w nowszych aparatach bez filtra dolnoprzepustowego. powinieneś wyłączyć tę opcję jeśli używasz jednego z takich aparatów, lub jeśli wyostrzasz zdjęcia w inny sposób (wymaga restartu)

source: security
pl: zabezpieczenia

source: ask before removing images from database
pl: pytaj przed usuwaniem zdjęć z bazy danych

source: always ask the user before any image is removed from DB.
pl: zawsze pytaj przed usuwaniem zdjęć z bazy danych.

source: ask before erasing images from disk / discarding history stack
pl: pytaj przed usuwaniem zdjęć z dysku lub porzucaniem historii edycji

source: always ask the user before any image file is deleted / history stack is discarded.
pl: zawsze pytaj przed usuwaniem zdjęć z dysku lub porzucaniem historii edycji.

source: send files to trash when erasing images
pl: przenoś pliki do kosza podczas kasowania zdjęć

source: send files to trash instead of permanently deleting files on system that supports it
pl: przenoś pliki do kosza zamiast kasować je nieodwracalnie (w systemach, które to obsługują)

source: ask before moving images from film roll folder
pl: pytaj przed przenoszeniem zdjęć z katalogu rolki filmu

source: always ask the user before any image file is moved.
pl: zawsze pytaj przed przenoszeniem zdjęć.

source: ask before copying images to new film roll folder
pl: pytaj przed kopiowaniem zdjęć do nowego katalogu rolki filmu

source: always ask the user before any image file is copied.
pl: zawsze pytaj przed kopiowaniem zdjęć.

source: ask before removing empty folders
pl: pytaj przed usunięciem pustych folderów

source: always ask the user before removing any empty folder. this can happen after moving or deleting images.
pl: zawsze pytaj przed usuwaniem pustego foldera. może to nastąpić po przeniesieniu lub usunięciu zdjęć.

source: ask before deleting a tag
pl: pytaj przed usunięciem etykiety

source: ask before deleting a style
pl: pytaj przed usunięciem stylu

source: cpu / gpu / memory
pl: cpu / gpu / pamięć

source: memory in megabytes to use for thumbnail cache
pl: rozmiar pamięci (MB) dla pamięci podręcznej miniaturek

source: this controls how much memory is going to be used for thumbnails and other buffers (needs a restart).
pl: ilość pamięci, jaka zostanie użyta na miniatury i inne bufory (wymaga ponownego uruchomienia).

source: enable disk backend for thumbnail cache
pl: przechowywanie miniaturek na dysku

source: if enabled, write thumbnails to disk (.cache/darktable/) when evicted from the memory cache. note that this can take a lot of memory (several gigabytes for 20k images) and will never delete cached thumbnails again. it's safe though to delete these manually, if you want. light table performance will be increased greatly when browsing a lot. to generate all thumbnails of your entire collection offline, run 'darktable-generate-cache'.
pl: po włączeniu, zapisuje miniaturki na dysku (.cache/darktable/), gdy zabraknie pamięci. może to zająć dużo miejsca (kilka gigabajtów przy 20tys. zdjęć) i nigdy nie kasuje zapisanych miniaturek. można je jednak bezpiecznie kasować ręcznie. wydajność trybu stołu podświetlanego przy przeglądaniu w dużej ilości bardzo się poprawi. aby wygenerować wszystkie miniaturki dla całej kolekcji, uruchom „darktable-generate-cache”.

source: enable disk backend for full preview cache
pl: przechowywanie pełnego podglądu na dysku

source: if enabled, write full preview to disk (.cache/darktable/) when evicted from the memory cache. note that this can take a lot of memory (several gigabytes for 20k images) and will never delete cached thumbnails again. it's safe though to delete these manually, if you want. light table performance will be increased greatly when zooming image in full preview mode.
pl: po włączeniu, zapisuje pełny podgląd na dysku (.cache/darktable/), gdy zabraknie miejsca w pamięci. może to zająć dużo miejsca (kilka gigabajtów przy 20tys. zdjęć) i nigdy nie kasuje zapisanych miniaturek. można je jednak bezpiecznie kasować ręcznie. wydajność trybu stołu podświetlanego przy powiększaniu zdjęć w trybie pełnego podglądu bardzo się poprawi.

source: number of background threads
pl: liczba wątków w tle

source: this controls for example how many threads are used to create thumbnails during import. the cache will grow to a maximum of twice this number of full resolution image buffers (needs a restart).
pl: wpływa np. na liczbę procesów używanych do tworzenia miniatur podczas importu. pamięć podręczna będzie rosła aż do dwukrotności tej liczby pełnej rozdzielczości bufora obrazu (wymagany restart).

source: host memory limit (in MB) for tiling
pl: ograniczenie pamięci (w MB) dla kafli

source: this variable controls the maximum amount of memory (in MB) a module may use during image processing. lower values will force memory hungry modules to process image with increasing number of tiles. setting this to 0 will omit any limit. values below 500 will be treated as 500 (needs a restart).
pl: zmienna ta określa maksymalną ilość pamięci (w MB), którą może użyć moduł podczas przetwarzania zdjęcia. mniejsze wartości zmuszą te moduły, które wymagają dużo pamięci do przetwarzania obrazu ze zwiększona ilością kafli. ustawienie 0 znosi wszystkie limity. wartości poniżej 500 będą traktowane jak 500 (wymagany restart).

source: minimum amount of memory (in MB) for a single buffer in tiling
pl: najmniejsza ilość pamięci (w MB) dla pojedynczego bufora kafli

source: if set to a positive, non-zero value this variable defines the minimum amount of memory (in MB) that tiling should take for a single image buffer. has precedence over heuristics based on host_memory_limit (needs a restart).
pl: przy wartości większej od zera, zmienna ta określa najmniejszą ilość pamięci (w MB), z której kafle będą korzystać przy buforowaniu jednego zdjęcia. ma pierwszeństwo przed heurystyką opartą na ograniczeniu pamięci dla kafli (wymagany restart).

source: activate OpenCL support
pl: włącz obsługę OpenCL

source: if found, use OpenCL runtime on your system for improved processing speed. can be switched on and off at any time.
pl: używaj OpenCL do przyspieszenia przetwarzania, jeśli zostanie wykryty w systemie. może być włączone lub wyłączone w dowolnym momencie.

source: not available
pl: niedostępne

source: not available on this system
pl: niedostępne w tym systemie

source: OpenCL scheduling profile
pl: profil szeregowania OpenCL

source: default
pl: domyślnie

source: multiple GPUs
pl: kilka kart graficznych

source: very fast GPU
pl: bardzo szybka karta graficzna

source: defines how preview and full pixelpipe tasks are scheduled on OpenCL enabled systems. default - GPU processes full and CPU processes preview pipe (adaptable by config parameters); multiple GPUs - process both pixelpipes in parallel on two different GPUs; very fast GPU - process both pixelpipes sequentially on the GPU.
pl: ustala, jak zadania podglądu i pełnego przetwarzania są szeregowane w systemach z włączonym OpenCL. domyślnie - pełne przetwarzanie na GPU, przetwarzanie podglądu na CPU; kilka kart graficznych - wszystkie zadania przetwarzane równolegle na dwóch GPU; bardzo szybka karta graficzna - wszystkie zadania przetwarzane sekwencyjnie na GPU.

source: storage
pl: miejsca danych

source: database
pl: baza danych

source: check for database maintenance
pl: sprawdź konieczność konserwacji bazy danych

source: on startup
pl: podczas uruchamiania

source: on close
pl: podczas zamykania

source: on both
pl: w obu przypadkach

source: on startup (don't ask)
pl: podczas uruchamiania (nie pytaj)

source: on close (don't ask)
pl: przy zamykaniu (nie pytaj)

source: on both (don't ask)
pl: w obu przypadkach (nie pytaj)

source: this option indicates when to check database fragmentation and perform maintenance
pl: opcja określa kiedy sprawdzać, czy baza danych wymaga konserwacji

source: database fragmentation ratio threshold
pl: próg fragmentacji bazy danych

source: fragmentation ratio above which to ask or carry out automatically database maintenance
pl: próg, powyżej którego baza danych zostanie uznana za wymagającą konserwacji

source: write sidecar file for each image
pl: zapisuj plik poboczny dla każdego zdjęcia

source: these redundant files can later be re-imported into a different database, preserving your changes to the image.
pl: te zbędne pliki mogą być później zaimportowane ponownie do innej bazy danych, pozwoli to na zachowanie zmian w zdjęciach.

source: store xmp tags in compressed format
pl: zapisuj skompresowane etykiety xmp

source: only large entries
pl: tylko duże

source: entries in xmp tags can get rather large and may exceed the available space to store the history stack in output files. this option allows xmp tags to be compressed and save space.
pl: wpisy w elementach xmp bywają duże i mogą przekroczyć ilość miejsca dostępnego dla zapisu historii w plikach wynikowych. opcja ta pozwala kompresować dane w elementach xmp dla zaoszczędzenia miejsca.

source: look for updated xmp files on startup
pl: wyszukuj zaktualizowane pliki xmp przy starcie

source: check file modification times of all xmp files on startup to check if any got updated in the meantime
pl: sprawdzaj czas modyfikacji wszystkich plików xmp przy starcie, by sprawdzić, czy zostały zmienione w międzyczasie

source: miscellaneous
pl: różne

source: interface
pl: interfejs

source: mouse wheel scrolls modules side panel by default
pl: kółko myszy domyślnie przewija moduły w panelach bocznych

source: when enabled, use mouse wheel to scroll modules side panel. use ctrl+alt to use mouse wheel for data entry. when disabled, this behavior is reversed
pl: jeśli opcja jest włączona, kółko myszy przewija moduły w panelach bocznych. użyj kółka z ctrl+alt do zmiany wartości parametrów. jeśli opcja jest wyłączona, zachowanie jest odwrotne

source: always show panels' scrollbars
pl: zawsze wyświetlaj paski przewijania paneli

source: defines whether the panel scrollbars should be always visible or activated only depending on the content. (need a restart)
pl: określa, czy paski przewijania paneli powinny być zawsze widoczne, czy aktywowane wyłącznie w zależności od kontekstu. (wymaga restartu)

source: method to use for getting the display profile
pl: sposób pobierania profilu monitora

source: all
pl: wszystkie
